In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

In [19]:
data =  { 

'A' : [ 40,30,89,89,18],
'B' : [ 40,40,20,20,18],
'C' : [ 56,76,45,76,32]

}

In [20]:
df = pd.DataFrame(data)

In [21]:
df.head()

    A   B   C
0  40  40  56
1  30  40  76
2  89  20  45
3  89  20  76
4  18  18  32

In [22]:
df.sort_index(axis=0,ascending=False)

    A   B   C
4  18  18  32
3  89  20  76
2  89  20  45
1  30  40  76
0  40  40  56

In [23]:
df

    A   B   C
0  40  40  56
1  30  40  76
2  89  20  45
3  89  20  76
4  18  18  32

In [24]:
df.sort_values(by='A',ascending=False)

    A   B   C
2  89  20  45
3  89  20  76
0  40  40  56
1  30  40  76
4  18  18  32

In [25]:
df.sort_values(by=['A','C'],ascending=False)

    A   B   C
3  89  20  76
2  89  20  45
0  40  40  56
1  30  40  76
4  18  18  32

In [26]:
df

    A   B   C
0  40  40  56
1  30  40  76
2  89  20  45
3  89  20  76
4  18  18  32

In [27]:
df.index = pd.date_range('20190513',periods=5)

In [28]:
df

             A   B   C
2019-05-13  40  40  56
2019-05-14  30  40  76
2019-05-15  89  20  45
2019-05-16  89  20  76
2019-05-17  18  18  32

In [32]:
x = df['A']
print(type(x))
x

<class 'pandas.core.series.Series'>

2019-05-13    40
2019-05-14    30
2019-05-15    89
2019-05-16    89
2019-05-17    18
Freq: D, Name: A, dtype: int64

In [33]:
x = df[['A']]
print(type(x))
x

<class 'pandas.core.frame.DataFrame'>

             A
2019-05-13  40
2019-05-14  30
2019-05-15  89
2019-05-16  89
2019-05-17  18

In [31]:
df[['A','C']]

             A   C
2019-05-13  40  56
2019-05-14  30  76
2019-05-15  89  45
2019-05-16  89  76
2019-05-17  18  32

In [34]:
df[1:4]

             A   B   C
2019-05-14  30  40  76
2019-05-15  89  20  45
2019-05-16  89  20  76

In [36]:
df[:3]

             A   B   C
2019-05-13  40  40  56
2019-05-14  30  40  76
2019-05-15  89  20  45

In [38]:
df['2019-05-13':'2019-05-16':2]

             A   B   C
2019-05-13  40  40  56
2019-05-15  89  20  45

In [46]:
df.loc['2019-05-13':'2019-05-15',['A','B']]

             A   B
2019-05-13  40  40
2019-05-14  30  40
2019-05-15  89  20

In [47]:
df.iloc[0,0]

40

In [49]:
df.iloc[::2,::2]

             A   C
2019-05-13  40  56
2019-05-15  89  45
2019-05-17  18  32

In [51]:
df.iloc[[0,3,4],[2,1,0]]

             C   B   A
2019-05-13  56  40  40
2019-05-16  76  20  89
2019-05-17  32  18  18

In [54]:
df.iat[2,2] # scalar

45

In [57]:
df.at[pd.Timestamp('20190515'),'B']

20

In [58]:
df

             A   B   C
2019-05-13  40  40  56
2019-05-14  30  40  76
2019-05-15  89  20  45
2019-05-16  89  20  76
2019-05-17  18  18  32

In [59]:
df[[True,False,True,True,False]]

             A   B   C
2019-05-13  40  40  56
2019-05-15  89  20  45
2019-05-16  89  20  76

In [60]:
df

             A   B   C
2019-05-13  40  40  56
2019-05-14  30  40  76
2019-05-15  89  20  45
2019-05-16  89  20  76
2019-05-17  18  18  32

a = np.array([[False,True,False],[True,False,True],[True,True,False],
              [True,True,True],[True,False,True]])

df[a]

In [64]:
df > 80

                A      B      C
2019-05-13  False  False  False
2019-05-14  False  False  False
2019-05-15   True  False  False
2019-05-16   True  False  False
2019-05-17  False  False  False

In [65]:
df[df > 80 ]

               A   B   C
2019-05-13   NaN NaN NaN
2019-05-14   NaN NaN NaN
2019-05-15  89.0 NaN NaN
2019-05-16  89.0 NaN NaN
2019-05-17   NaN NaN NaN

In [66]:
df['A'] > 80

2019-05-13    False
2019-05-14    False
2019-05-15     True
2019-05-16     True
2019-05-17    False
Freq: D, Name: A, dtype: bool

In [67]:
df[df['A'] > 80]

             A   B   C
2019-05-15  89  20  45
2019-05-16  89  20  76

In [71]:
df[(df['A']>80)|(df['C']>45)]

             A   B   C
2019-05-13  40  40  56
2019-05-14  30  40  76
2019-05-15  89  20  45
2019-05-16  89  20  76

In [72]:
df[(df['A']>80)&(df['C']>45)]

             A   B   C
2019-05-16  89  20  76

In [73]:
l = [1,2,3]

In [74]:
l1 = l

In [75]:
l1.append('hi')

In [76]:
l

[1, 2, 3, 'hi']

In [77]:
l1

[1, 2, 3, 'hi']

In [78]:
id(l)

2652619861768

In [79]:
id(l1)

2652619861768

In [80]:
l = [ 1,2,3,4]
l1 = l.copy()

In [81]:
id(l)

2652619703112

In [82]:
id(l1)

2652619666440

In [83]:
l.append('hi')

In [84]:
l

[1, 2, 3, 4, 'hi']

In [85]:
l1

[1, 2, 3, 4]

In [86]:
df1 = df.copy()

In [91]:
df1['D'] = pd.Categorical([ 'haan','naa','naa','haa','haa'])

In [92]:
df1.dtypes

A       int64
B       int64
C       int64
D    category
dtype: object

In [93]:
df1

             A   B   C     D
2019-05-13  40  40  56  haan
2019-05-14  30  40  76   naa
2019-05-15  89  20  45   naa
2019-05-16  89  20  76   haa
2019-05-17  18  18  32   haa

In [96]:
df1[df1['D'].isin(['haa'])]

             A   B   C    D
2019-05-16  89  20  76  haa
2019-05-17  18  18  32  haa

In [98]:
df[df['A'].isin([40,89])]

             A   B   C
2019-05-13  40  40  56
2019-05-15  89  20  45
2019-05-16  89  20  76

In [99]:
df[(df['A']==40)|(df['A']==89)]

             A   B   C
2019-05-13  40  40  56
2019-05-15  89  20  45
2019-05-16  89  20  76

In [100]:
df['E'] = 1

In [101]:
df

             A   B   C  E
2019-05-13  40  40  56  1
2019-05-14  30  40  76  1
2019-05-15  89  20  45  1
2019-05-16  89  20  76  1
2019-05-17  18  18  32  1

In [103]:
df['F']  = [ 1,2,3,np.nan,np.nan]

In [104]:
df

             A   B   C  E    F
2019-05-13  40  40  56  1  1.0
2019-05-14  30  40  76  1  2.0
2019-05-15  89  20  45  1  3.0
2019-05-16  89  20  76  1  NaN
2019-05-17  18  18  32  1  NaN

In [109]:
df

             A   B   C  E    F
2019-05-13  40  40  56  1  1.0
2019-05-14  30  40  76  1  2.0
2019-05-15  89  20  45  1  3.0
2019-05-16  89  20  76  1  NaN
2019-05-17  18  18  32  1  NaN

In [112]:
df

             A   B   C  E    F
2019-05-13  40  40  56  1  1.0
2019-05-14  30  40  76  1  2.0
2019-05-15  89  20  45  1  3.0
2019-05-16  89  20  76  1  NaN
2019-05-17  18  18  32  1  NaN

In [123]:
a = pd.Series(np.nan)
df = df.astype(float)

In [124]:
df

               A     B     C    E    F
2019-05-13  40.0  40.0  56.0  1.0  1.0
2019-05-14  30.0  40.0  76.0  1.0  2.0
2019-05-15  89.0  20.0  45.0  1.0  3.0
2019-05-16  89.0  20.0  76.0  1.0  NaN
2019-05-17  18.0  18.0  32.0  1.0  NaN

In [125]:
df.iat[2,2] = np.nan
df.iat[1,1] = np.nan

In [141]:
df2 = pd.DataFrame({
    'A':[np.nan,np.nan],
    'B':[np.nan,5],
    'C':[np.nan,np.nan],
    'E':[np.nan,6],
    'F':[np.nan,10]
},index=pd.date_range('20190517',periods=2))
df2

             A    B   C    E     F
2019-05-17 NaN  NaN NaN  NaN   NaN
2019-05-18 NaN  5.0 NaN  6.0  10.0

In [142]:
df

               A     B     C    E    F
2019-05-13  40.0  40.0  56.0  1.0  1.0
2019-05-14  30.0   NaN  76.0  1.0  2.0
2019-05-15  89.0  20.0   NaN  1.0  3.0
2019-05-16  89.0  20.0  76.0  1.0  NaN
2019-05-17  18.0  18.0  32.0  1.0  NaN

In [143]:
new_df = pd.concat([df,df2])

In [144]:
new_df

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0   NaN  76.0  1.0   2.0
2019-05-15  89.0  20.0   NaN  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   NaN
2019-05-17  18.0  18.0  32.0  1.0   NaN
2019-05-17   NaN   NaN   NaN  NaN   NaN
2019-05-18   NaN   5.0   NaN  6.0  10.0

In [152]:
new_df.dropna()

               A     B     C    E    F
2019-05-13  40.0  40.0  56.0  1.0  1.0

In [153]:
new_df.dropna(how='all')

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0   NaN  76.0  1.0   2.0
2019-05-15  89.0  20.0   NaN  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   NaN
2019-05-17  18.0  18.0  32.0  1.0   NaN
2019-05-18   NaN   5.0   NaN  6.0  10.0

In [155]:
new_df

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0   NaN  76.0  1.0   2.0
2019-05-15  89.0  20.0   NaN  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   NaN
2019-05-17  18.0  18.0  32.0  1.0   NaN
2019-05-17   NaN   NaN   NaN  NaN   NaN
2019-05-18   NaN   5.0   NaN  6.0  10.0

In [154]:
new_df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [2019-05-13 00:00:00, 2019-05-14 00:00:00, 2019-05-15 00:00:00, 2019-05-16 00:00:00, 2019-05-17 00:00:00, 2019-05-17 00:00:00, 2019-05-18 00:00:00]

In [157]:
new_df.dropna(how='all',axis=1)

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0   NaN  76.0  1.0   2.0
2019-05-15  89.0  20.0   NaN  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   NaN
2019-05-17  18.0  18.0  32.0  1.0   NaN
2019-05-17   NaN   NaN   NaN  NaN   NaN
2019-05-18   NaN   5.0   NaN  6.0  10.0

In [158]:
df.fillna(0.0)

               A     B     C    E    F
2019-05-13  40.0  40.0  56.0  1.0  1.0
2019-05-14  30.0   0.0  76.0  1.0  2.0
2019-05-15  89.0  20.0   0.0  1.0  3.0
2019-05-16  89.0  20.0  76.0  1.0  0.0
2019-05-17  18.0  18.0  32.0  1.0  0.0

In [169]:
new_df['A'].fillna(df['A'].mean())

2019-05-13    40.0
2019-05-14    30.0
2019-05-15    89.0
2019-05-16    89.0
2019-05-17    18.0
2019-05-17    53.2
2019-05-18    53.2
Name: A, dtype: float64

In [171]:
df = new_df.copy()

In [172]:
df

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0   NaN  76.0  1.0   2.0
2019-05-15  89.0  20.0   NaN  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   NaN
2019-05-17  18.0  18.0  32.0  1.0   NaN
2019-05-17   NaN   NaN   NaN  NaN   NaN
2019-05-18   NaN   5.0   NaN  6.0  10.0

In [173]:
df.dropna(how='all',inplace=True)

In [174]:
df

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0   NaN  76.0  1.0   2.0
2019-05-15  89.0  20.0   NaN  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   NaN
2019-05-17  18.0  18.0  32.0  1.0   NaN
2019-05-18   NaN   5.0   NaN  6.0  10.0

In [181]:
def fill_na(df):
    for column in df.columns : 
        df[column].fillna(df[column].mean(),inplace=True)

In [182]:
fill_na(df)

In [183]:
df

               A     B     C    E     F
2019-05-13  40.0  40.0  56.0  1.0   1.0
2019-05-14  30.0  20.6  76.0  1.0   2.0
2019-05-15  89.0  20.0  60.0  1.0   3.0
2019-05-16  89.0  20.0  76.0  1.0   4.0
2019-05-17  18.0  18.0  32.0  1.0   4.0
2019-05-18  53.2   5.0  60.0  6.0  10.0

In [184]:
df.iat[3,3] = 100.0

In [185]:
df

               A     B     C      E     F
2019-05-13  40.0  40.0  56.0    1.0   1.0
2019-05-14  30.0  20.6  76.0    1.0   2.0
2019-05-15  89.0  20.0  60.0    1.0   3.0
2019-05-16  89.0  20.0  76.0  100.0   4.0
2019-05-17  18.0  18.0  32.0    1.0   4.0
2019-05-18  53.2   5.0  60.0    6.0  10.0

In [195]:
data = { 
    'A' : 1,
    'B' : np.arange(50,60),
    'C' : pd.Categorical([ np.random.choice(['pass','fail']) for var in range(10)]),
    'D' : pd.Categorical([np.random.choice(['good','bad','average']) for var in range(10)]),
    'E' : [ chr(var) for var in range(65,75)]

}

In [196]:
df = pd.DataFrame(data)

In [197]:
df

   A   B     C        D  E
0  1  50  pass  average  A
1  1  51  fail     good  B
2  1  52  fail      bad  C
3  1  53  pass      bad  D
4  1  54  pass  average  E
5  1  55  pass      bad  F
6  1  56  fail      bad  G
7  1  57  fail  average  H
8  1  58  pass      bad  I
9  1  59  fail      bad  J

In [200]:
df.drop('E',axis=1,inplace=True)

In [201]:
df

   A   B     C        D
0  1  50  pass  average
1  1  51  fail     good
2  1  52  fail      bad
3  1  53  pass      bad
4  1  54  pass  average
5  1  55  pass      bad
6  1  56  fail      bad
7  1  57  fail  average
8  1  58  pass      bad
9  1  59  fail      bad

In [202]:
from sklearn.linear_model import LinearRegression

In [203]:
clf = LinearRegression()

In [204]:
clf.fit(df.drop('C',axis=1),df['C'])

ValueError: could not convert string to float: 'average'

In [205]:
df

   A   B     C        D
0  1  50  pass  average
1  1  51  fail     good
2  1  52  fail      bad
3  1  53  pass      bad
4  1  54  pass  average
5  1  55  pass      bad
6  1  56  fail      bad
7  1  57  fail  average
8  1  58  pass      bad
9  1  59  fail      bad

In [206]:
C = { 'pass':1,'fail':0}
D = { 'bad':0,'average':1,'good':2}

In [208]:
df['C'] = df['C'].map(C)

In [209]:
df['D'] = df['D'].map(D)

In [210]:
df

   A   B  C  D
0  1  50  1  1
1  1  51  0  2
2  1  52  0  0
3  1  53  1  0
4  1  54  1  1
5  1  55  1  0
6  1  56  0  0
7  1  57  0  1
8  1  58  1  0
9  1  59  0  0